Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.UseTwinProfiles Property
 Gets or sets a value indicating whether twin profiles are used.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool UseTwinProfiles { get; set; }
Public Property UseTwinProfiles As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace